## Plan Result (915: cft_preview_ado - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.sops-kv-reader
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.sops-kv-reader will be created
  + resource "azurerm_role_assignment" "sops-kv-reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappsdevkv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.azure-devops-mi will be created
  + resource "azurerm_user_assigned_identity" "azure-devops-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "azure-devops-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/ado-shared-infra"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 915: cft_preview_ado - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Target":"915: cft_preview_ado - TerraformPlanApply","Vars":{}} -->